added mermaid
-- used mermaid graph instead of hardcoded one
